cats99/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    @kittys = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @kitty = Cat.find(params[:id])

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

    @kitty = Cat.new(cat_params)
    if @kitty.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @kitty = Cat.find(params[:id])